app/controllers/soccer_players_controller.rb

SELECT * FROM "soccer_players" WHERE ("soccer_players"."id" = 761560594)
---
  def edit
    @soccer_player = SoccerPlayer.find(params[:id])

INSERT INTO "soccer_players" ("name", "team_id", "updated_at", "level", "age", "active", "created_at") VALUES('Marina Salazar', NULL, '2009-05-01 01:45:23', 'Amateur', 21, 'f', '2009-05-01 01:45:23')
---
  def create
    @soccer_player = SoccerPlayer.new(params[:soccer_player])

    if @soccer_player.save

SELECT * FROM "soccer_players" WHERE ("soccer_players"."id" = 935035895)
UPDATE "soccer_players" SET "team_id" = 255871768, "updated_at" = '2009-05-01 01:48:37' WHERE "id" = 935035895
---
  def update
    @soccer_player = SoccerPlayer.find(params[:id])

    if @soccer_player.update_attributes(params[:soccer_player])

SELECT * FROM "soccer_players" WHERE ("soccer_players"."id" = 935035896)
DELETE FROM "soccer_players" WHERE "id" = 935035896
---
  def destroy
    @soccer_player = SoccerPlayer.find(params[:id])
    @soccer_player.destroy