app/controllers/teams_controller.rb

  def show
    @team = Team.find_by_id(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = '255871768') LIMIT 1

  def edit
    @team = Team.find(params[:id])
---
SELECT * FROM "teams" WHERE ("teams"."id" = 255871768)

  def create
    @team = Team.new(params[:team])

    if @team.save
---
INSERT INTO "teams" ("name", "city", "updated_at", "championships", "level", "state", "created_at") VALUES('WCFC', 'Guadlajara', '2009-05-01 00:12:04', 0, 'Amateur', 'Jalisco', '2009-05-01 00:12:04')

  def destroy
    @team = Team.find(params[:id])
    @team.destroy
---
SELECT * FROM "teams" WHERE ("teams"."id" = 582136501)
DELETE FROM "teams" WHERE "id" = 582136501